python/index.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2020-06-04 Do 15:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Felix Brendel">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Hausaufgaben Tag 1</h2>
<div class="outline-text-2" id="text-1">
<p>
Mach dir am besten für die Hausaufgaben einen neuen Order, damit man die Dateien dann schnell
wiederfinden kann.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Sternmuster 1</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In dieser Aufgabe geht es darum, verschiedene Muster auf dem Terminal auszugeben. Das erste ist ein
Dreieck. Der Benutzer wird zuerst nach einer natürlichen Zahl gefragt und dann soll ein Dreieck mit
der Größe der Eingabe des Benutzers ausgegeben werden.
</p>

<p>
Das sieht dann zum Beispiel so aus, wenn der Benutzer <code>7</code> eingibt:
</p>

<pre class="example">
Geben Sie eine Größe ein: 7

*
**
***
****
*****
******
*******
</pre>

<p>
Oder so:
</p>


<pre class="example">
Geben Sie eine Größe ein: 3

*
**
***
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Sternmuster 2</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Als nächstes wollen wir das Dreieck andersherum ausgeben:
</p>

<pre class="example">
Geben Sie eine Größe ein: 7

      *
     **
    ***
   ****
  *****
 ******
*******
</pre>

<p>
Oder auch:
</p>

<pre class="example">
Geben Sie eine Größe ein: 3

  *
 **
***
</pre>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Sternmuster 3</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Jetzt kombinieren wir die Muster aus 1 und 2 und wollen dieses Muster erstellen:
</p>

<pre class="example">
Geben Sie eine Größe ein: 7

      * *
     ** **
    *** ***
   **** ****
  ***** *****
 ****** ******
******* *******
</pre>

<p>
Oder auch:
</p>

<pre class="example">
Geben Sie eine Größe ein: 3

  * *
 ** **
*** ***
</pre>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Summe aller Zahlen in einem Intervall</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Schreibe ein Programm, dass den Benutzer nach einer natürlichen Zahl fragt und dann die Summe aller
Zahlen von 0 bis zu dieser Zahl berechnet. Das sieht dann zum Beispiel so aus:
</p>

<pre class="example">
Geben Sie eine Zahl ein: 4
10
</pre>

<p>
10 ist das Ergebnis weil:
\(1+2+3+4=10\)
</p>

<p>
Oder
</p>

<pre class="example">
Geben Sie eine Zahl ein: 10
55
</pre>
<p>
55 ist das Ergebnis weil:
\(1+2+3+4+5+6+7+8+9+10=55\)
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Summe aller geraden Zahlen in einem Intervall</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Jetzt erweitern wir das Programm aus der letzten Aufgabe sodass nur noch die Summe der geraden
Zahlen berechnet wird:
</p>


<pre class="example">
Geben Sie eine Zahl ein: 4
6
</pre>

<p>
6 ist das Ergebnis weil:
\(2+4=6\)
</p>

<p>
Oder
</p>

<pre class="example">
Geben Sie eine Zahl ein: 10
30
</pre>
<p>
55 ist das Ergebnis weil:
\(2+4+6+8+10=30\)
</p>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Hausaufgaben Tag 1</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Sternmuster 1</a></li>
<li><a href="#sec-1-2">1.2. Sternmuster 2</a></li>
<li><a href="#sec-1-3">1.3. Sternmuster 3</a></li>
<li><a href="#sec-1-4">1.4. Summe aller Zahlen in einem Intervall</a></li>
<li><a href="#sec-1-5">1.5. Summe aller geraden Zahlen in einem Intervall</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Felix Brendel</p>
<p class="date">Created: 2020-06-04 Do 15:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.2 (<a href="http://orgmode.org">Org-mode</a> 9.3.6)</p>
</div>
</footer>
</body>
</html>
